src/cf/ChartsOfCharacteristicTypes/пбп_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>пбп_ПредопределенныеЗначения</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>256</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.пбп_ПредопределенныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кэшируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияЭлементов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.пбп_ПредопределенныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/пбп_ПредопределенныеЗначения/Forms/ФормаГенератораКода/Ext/Form/Module.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("Изменение", Метаданные.ПланыВидовХарактеристик.пбп_ПредопределенныеЗначения) Тогда
		
		ВызватьИсключение НСтр("ru = 'Недостаточно прав для генерации кода предопределенных значений.'");
		
	КонецЕсли;
	
	УстановитьЗначенияПоУмолчанию();
	ЗаполнитьСпискиВыбора();
	НастроитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭтоГруппаПриИзменении(Элемент)
	
	НастроитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидТипаПриИзменении(Элемент)
	
	НастроитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сгенерировать(Команда)
	
	Если Не ЗначениеЗаполнено(Наименование) Или Не ЗначениеЗаполнено(ИдентификаторНастройки) Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Заполните наименование и идентификатор.'"));
		Возврат;
		
	КонецЕсли;
	
	Код = пбп_ПредопределенныеЗначенияКлиентСервер.КодЭлементаПредопределенногоЗначения(ОписаниеЭлемента());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	ВидТипа = "Строка";
	ДопустимаяДлина = "Переменная";
	ЧастиДаты = "Дата";
	Разрядность = 10;
	РазрядностьДробнойЧасти = 0;
	ДлинаСтроки = 0;
	УровеньИерархии = 0;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	Элементы.ВидТипа.РежимВыбораИзСписка = Истина;
	Элементы.ВидТипа.СписокВыбора.Добавить("Строка");
	Элементы.ВидТипа.СписокВыбора.Добавить("Число");
	Элементы.ВидТипа.СписокВыбора.Добавить("Булево");
	Элементы.ВидТипа.СписокВыбора.Добавить("Дата");
	Элементы.ВидТипа.СписокВыбора.Добавить("Другой");
	
	Элементы.ДопустимаяДлина.РежимВыбораИзСписка = Истина;
	Элементы.ДопустимаяДлина.СписокВыбора.Добавить("Переменная");
	Элементы.ДопустимаяДлина.СписокВыбора.Добавить("Фиксированная");
	
	Элементы.ЧастиДаты.РежимВыбораИзСписка = Истина;
	Элементы.ЧастиДаты.СписокВыбора.Добавить("Дата");
	Элементы.ЧастиДаты.СписокВыбора.Добавить("Время");
	Элементы.ЧастиДаты.СписокВыбора.Добавить("ДатаВремя");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПВХ.ИдентификаторНастройки КАК Идентификатор
	|ИЗ
	|	ПланВидовХарактеристик.пбп_ПредопределенныеЗначения КАК ПВХ
	|ГДЕ
	|	ПВХ.ЭтоГруппа
	|	И НЕ ПВХ.ПометкаУдаления
	|	И ПВХ.ИдентификаторНастройки <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Идентификатор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Элементы.ИдентификаторРодитель.СписокВыбора.Добавить(Выборка.Идентификатор);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервере
Процедура НастроитьВидимостьЭлементов()
	
	Элементы.ГруппаПараметрыЭлемента.Видимость = Не ЭтоГруппа;
	Элементы.ГруппаТипЗначения.Видимость = Не ЭтоГруппа;
	Элементы.УровеньИерархии.Видимость = ЭтоГруппа;
	
	ЭтоСтрока = ВидТипа = "Строка";
	ЭтоЧисло = ВидТипа = "Число";
	ЭтоДата = ВидТипа = "Дата";
	ЭтоДругой = ВидТипа = "Другой";
	
	Элементы.ДлинаСтроки.Видимость = ЭтоСтрока;
	Элементы.ДопустимаяДлина.Видимость = ЭтоСтрока;
	Элементы.Разрядность.Видимость = ЭтоЧисло;
	Элементы.РазрядностьДробнойЧасти.Видимость = ЭтоЧисло;
	Элементы.Неотрицательное.Видимость = ЭтоЧисло;
	Элементы.ЧастиДаты.Видимость = ЭтоДата;
	Элементы.ИмяТипа.Видимость = ЭтоДругой;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеЭлемента()
	
	Описание = Новый Структура;
	Описание.Вставить("Наименование", Наименование);
	Описание.Вставить("ИдентификаторНастройки", ИдентификаторНастройки);
	Описание.Вставить("ЭтоГруппа", ЭтоГруппа);
	Описание.Вставить("ИдентификаторРодитель", ИдентификаторРодитель);
	Описание.Вставить("УровеньИерархии", УровеньИерархии);
	Описание.Вставить("Пароль", Пароль);
	Описание.Вставить("СписокЗначений", СписокЗначений);
	Описание.Вставить("Кэшируется", Кэшируется);
	Описание.Вставить("ВидТипа", ВидТипа);
	Описание.Вставить("ДлинаСтроки", ДлинаСтроки);
	Описание.Вставить("ДопустимаяДлина", ДопустимаяДлина);
	Описание.Вставить("Разрядность", Разрядность);
	Описание.Вставить("РазрядностьДробнойЧасти", РазрядностьДробнойЧасти);
	Описание.Вставить("Неотрицательное", Неотрицательное);
	Описание.Вставить("ЧастиДаты", ЧастиДаты);
	Описание.Вставить("ИмяТипа", ИмяТипа);
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти
